---
kind: method
id: M:Autodesk.Revit.DB.LinePattern.#ctor(System.String)
source: html/b1d2cf26-ba93-7697-0249-96e62f20af59.htm
---
# Autodesk.Revit.DB.LinePattern.#ctor Method

Creates a line pattern with given name.

## Syntax (C#)
```csharp
public LinePattern(
	string name
)
```

## Parameters
- **name** (`System.String`) - The name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null